# Реализовать базовый класс Worker (работник), в котором определить атрибуты: name, surname, position (должность),
# income (доход). Последний атрибут должен быть защищенным и ссылаться на словарь, содержащий элементы: оклад и
# премия, например, {"wage": wage, "bonus": bonus}. Создать класс Position (должность) на базе класса Worker. В
# классе Position реализовать методы получения полного имени сотрудника (get_full_name) и дохода с учетом премии (
# get_total_income). Проверить работу примера на реальных данных (создать экземпляры класса Position,
# передать данные, проверить значения атрибутов, вызвать методы экземпляров).
class Worker:
    def __init__(self, name, surname, position, wage, bonus):
        self.name = name
        self.surname = surname
        self.position = position
        self._income = {'wage': wage, 'bonus': bonus}


class Position(Worker):
    def get_full_name(self):
        return f'{self.name} {self.surname}'

    def get_total_income(self):
        return sum(self._income.values())


vasya = Position("Вася", "Петров", "менеджер", 30000, 5000)
petya = Position("Петя", "Васильев", "сисадмин", 70000, 20000)
attrs = lambda man: f"{man.name} {man.surname} {man.position}"
methods = lambda man: f"{man.get_full_name()} {str(man.get_total_income())}"
print(attrs(vasya))
print(methods(vasya))
print(attrs(petya))
print(methods(petya))