# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools. Обратите внимание, что создаваемый цикл
# не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
from itertools import count, cycle


def func_a(startnum, endnum):
    for i in count(startnum):
        if i > endnum:
            break
        yield i


def func_b(arr, length):
    for i, el in enumerate(cycle(arr)):
        if i == length:
            break
        yield el


print(list(func_b(func_a(4, 7), 13)))

