# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие
# лекционных, практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого
# предмета не обязательно были все типы занятий. Сформировать словарь, содержащий название предмета и общее
# количество занятий по нему. Вывести словарь на экран.
# Примеры строк файла:
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
#
# Пример словаря:
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
def lessons(filename):
    result = dict()
    for line in open(filename, 'r'):
        name, hours = line.split(':')
        hours = sum(map(int, ''.join(filter(lambda s: s.isdigit() or s.isspace(), hours)).split()))
        result[name] = hours
    return result


print(lessons('example6'))