# Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

def salary(pay, bonus=0, hours=160):
    return pay * hours + bonus


print(f"Salary is {salary(322, 1005.00, 144)}")

